/*
 * Задача 8: «Фибоначчи»
 *
 * Последовательность Фибоначчи — это порядок чисел, где каждое последующее
 * число является суммой двух предыдущих: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34.
 * 
 * Напишите функцию, которая принимает на вход число n и возвращает n-й элемент
 * последовательности Фибоначчи.
*/

function fibonacci(n) {
    const arrFibo = new Array(n);// Исправлено по замечанию ревьюера. let заменил на const // создадим пустой контейнер (массив) из n - Мест в нем
    arrFibo[0] = 0;
    arrFibo[1] = 1; // первые два элемента не вычисляемые создадим их ручками 
    /* все остальное создаим циклом for по фрмуле ряда Фибоначчи ( f(n) = f(n-1) + f(n-2) начиная с элемента [2]*/
    for (let i = 2; i < n; i++) {
      arrFibo[i] = arrFibo[i-1] + arrFibo[i-2];
    }
    return arrFibo[n-1];
};


console.log(fibonacci(3))