/*
 * Задача 6: «Уникальные числа»
 *
 * Напишите функцию uniq(arr), принимающую на вход массив целых чисел.
 * Функция должна возвращать массив уникальных чисел, которые содержатся
 * в переданном массиве. То есть, дубликаты должны быть удалены.
 * 
*/


function uniq(arr) {
  const newArr = []; // Исправлено по замечанию ревьюера - Имейте ввиду, что массивы и объекты нужно объявлять через const, так как Вы не меняете их ссылку в коде, а меняете внутренности. 
  // нужен пустой массив (контейнер) под новый массив уникальных чисел 
  for (let i = 0, l = arr.length; i < l; i++) // от индекса 0 до полной длинны массива перебираем элементы по индексам
    return Array.from(new Set(arr)); // Внесено по предложению ревьюера // От себя - ПРОСТО КРУТО! Спаибо!
  return newArr;
}



console.log(uniq([1, 2, 5, 4, 2])); // [1, 2, 5, 4]
console.log(uniq([3, 3, 3, 5])); // [3, 5]
console.log(uniq([1, 4, 2, 2, 3, 4, 8])); // [1, 4, 2, 3, 8]
console.log(uniq([1, 4, 2, 2, 3, 4, 8, 8]));