/*
 * Задача 7: «Анаграмма»
 *
 * Два слова называют анаграммами, если они состоят из одних и тех же букв.
 * Напишите функцию, проверяющую, являются ли две строки анаграммами друг друга
 * (регистр букв не имеет значения). Для простоты примите, что в этих строках
 * нет пробелов и знаков препинания.
 * 
*/


function anagram(str1, str2) {
  str1 = str1.toLowerCase();
  str2 = str2.toLowerCase();
  if (str1 == str2){
    return false;  /* если это просто одно и то же слово - это не анагарма */
  } else {
  str1 = str1.split('').sort().join('');  // с удивлением обнаружил, что просто массивы сравнить не получиться , даже отсротированные, только строки!
  str2 = str2.split('').sort().join('');
    return str1 == str2;
  };
}
 

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(anagram('finder', 'Friend')); // true
console.log(anagram('hello', 'bye')); // false