/*
 * Задача 10: «Факториал»
 *
 * Напишите функцию factorial(n), возвращающую факториал неотрицательного
 * целого числа. Факториал — это произведение всех натуральных чисел
 * от 1 до n включительно. Факториал 0 равен 1.
 * 
*/

function factorial(n) {
  // Напишите код здесь
  const arrNumbers = []; // Исправлено по замечанию ревьюера. Заменил let на const //создадим пустой контейнер под будущий массив
  if (n == 0){
    return 1; // фактоиал 0 равен 1 и все тут 
  } else {
    for (let i = 1; i <= n; i++){
      arrNumbers.push(i); // наполняем  массив последовательностью от 1 до n
    }
  }
   let res = 1; // если умножить чило на 1 = число
    for (let k = 1; k < arrNumbers.length; k++){
      res *= arrNumbers[k]; // просто собираем произведение всех элементов массива 
   }
   return res;
}

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(factorial(0)); // 1
console.log(factorial(1)); // 1
console.log(factorial(6)); // 720