/*
 * Задача 3: «Развернуть слова в предложении»
 *
 * Напишите функцию reverseWords(str), принимающую на вход строку.
 * Функция должна вернуть новую строку, расставив слова в обратном
 * порядке.Если в строке есть знаки препинания, их можно удалить
 * или оставить — на ваше усмотрение.
 *
*/

function reverseWords(str) {
    str = str.replace(/[.,\/#!$%?\^&\*;:{}=\-_`~()]/g,''); // попробовал все, что в голову пришло заменить на '' - ничего
    str = str.split(' ').reverse().join(' ');
    return str;
}


console.log(reverseWords('всегда много путей достичь цель есть')); // "есть цель достичь путей много всегда"
console.log(reverseWords('испробовать их все должны вы')); // "вы должны все их испробовать"
console.log(reverseWords('всегда? много{} путей, достичь: цель& есть!'))