/*
 * Задача 13: «Сумма двух»
 *
 * Напишите функцию sumOfTwo(arr, num). Её аргументы: массив целых чисел arr
 * и целое число num. Функция должна вернуть true, если в переданном массиве
 * есть какие-то два числа, чья сумма равна num. Если же такой пары чисел нет,
 * функция должна вернуть false.
 * 
*/

/* перерыл весь Stack Overflow - не мог сообразить как правилно все элементы массива сложить между собой (надо начинать со второго элемента, что индекс должен быть другой понял сразу*/ 
function sumOfTwo(arr, sum) {
    for (let i = 0; i < arr.length; i++) { /* последовательно перебираем массив от первого до последнего элемента */
      for (let j = i + 1; j < arr.length; j++) { /* теперь перебираем этот же массив но начиная со втрого элемента (чтобы в таком случае [1, 2, 3, 4] получалось 1+2; 1+3; 1+4) */
        let sumElArr = arr[i] + arr[j]; // Берем в каждой итеррации сумму элементов
        if (sumElArr == sum){ /* проверяем на истинность */
          return true;} // если нашли - сообщаем
        }
      }
    return false; // если истинного значения не нашлось, то выводим false
  }

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(sumOfTwo([1, 2, 3, 4, 5], 4)); // true (так как 1 + 3 === 4)
console.log(sumOfTwo([1, 2, 3, 4, 5], 100)); // false