/*
 * Задача 12: «Посчитать количество нулей»
 *
 * Напишите функцию countZeros(n), принимающую на вход натуральное число n.
 * Возвращать функция должна суммарное количество нулей, содержащихся во всех числах от 1 до n включительно.
 *
*/


function countZeros(n) {
  let counter = 0; // счетчик ставим на 0
    for (let i = 1; i <= n; i++){ /* идем от единицы до n последовательным перебором */
      const numStr = String(i); // По замечанию ревьюера let заменен на const // Создаем отдельную строковую переменную из аргуметна счетчика. Нужна именно строка, чтобы регуляркой из не ноли вытянуть 
      const zeroStr = numStr.replace(/[1-9]/g, '');// По замечанию ревьюера let заменен на const  // Вынимаем только нули и заносим их в строку у котрой будем считать длинну - НУЛИ
      counter += zeroStr.length; // считаем нули по длине строки и кидаем их в счетчик
    }
  return counter;
  }   

// Протестируйте решение, вызывая функцию с разными аргументами:


console.log(countZeros(20)); // 2 – два нуля, по одному в числах 10 и 20
console.log(countZeros(100)); // 11 – 11 нулей в числах: 10, 20, 30, 40, 50, 60, 70, 80, 90, 100
