/*
 * Задача 11: «Пересечения массивов»
 *
 * Напишите функцию intersection(arr1, arr2). Она должна принимать
 * на вход два массива целых чисел. Функция должна вернуть новый
 * массив чисел, содержащихся в обоих исходных массивах.
 * 
*/



function intersection(array1, array2) {
    const arr = []; // Исправлено по замечанию ревьюера let заменен на const // создаем пустой массив под сбор пересечений
    for (let i = 0; i < array1.length; i++) { /* идем по массиву */
      if (array2.includes(array1[i])) { /* если есть в array2 элемент array1[i] */
        arr.push(array1[i]); /* толкаем его в контейнер для пересечений */
      }
    }
    /* но могут возни кнуть проблемы - например вот intersection([1, 1, 5, 4, 2], [8, 91, 4, 1, 1, 3]) в резултате получим [1, 1, 4] */
    /* То есть для пободных случаев нужно убрать повторения */
    const arrRes = [];// Исправлено по замечанию ревьюера let заменен на const // создаем результирующий массив
    for(let k = 0; k < arr.length; k++){  /* идем по массиву arr из предыдущего пробега - там где случились повторения */
        if(arrRes.indexOf(arr[k]) == -1){ /* выглядит немножко странно при первом проходе, если нет элемнта arr[k] то толкаем его, но про поторном проходе */
        /* если увидит вторую , пятую или десятую единицу, то не станет ее толкать в результирующий массив */
        arrRes.push(arr[k]); 
        }
    }
    return arrRes;
  }


// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(intersection([1, 5, 4, 2], [8, 91, 4, 1, 3])); // [4, 1]
console.log(intersection([1, 5, 4, 2], [7, 12])); // []
console.log(intersection([1, 1, 5, 4, 2], [8, 91, 4, 1, 1, 3]));