/*
 * Задача 1: «Палиндром»
 *
 * Палиндром — это слово, предложение или последовательность символов,
 * которая читается слева направо так же, как и справа налево. Например,
 * «топот» и «Анна» — палиндромы, а «привет» и «Витя» — нет.
 *
 * Напишите функцию palindrome(str), принимающую как аргумент строку.
 * Функция должна вернуть true, если строка — палиндром, и false, если нет.
 * 
 * Считайте, что на вход всегда передаётся слово: то есть знаков препинания
 * и пробелов в аргументе быть не может.
 * 
*/

function palindrome(str) {
  str = str.toLowerCase(); // приводим к нижнему регистру, чтобы снять его (регистра) влияние
  str = str.replace(/[^а-яa-z]/g, '') // убираем из строки все кроме маленьких русских и английских букв
  const newStr = str.split('').reverse().join(''); // снчала расщепляем по буквам, затем разворачиваем, далее объединям в строку (про множестве словб строка будет бессмысленой), для сравнения.
  if (str == newStr){ /* сравниваем строки */
    return true;
  }
  return false;
}


// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(palindrome('топот')); // должно быть true
console.log(palindrome('Saippuakivikauppias')); // true
console.log(palindrome('привет')); // false
console.log(palindrome('О, лета тело!')); // true
console.log(palindrome('Not so, Boston')); // вариант на английском

/*
* Бонус. Задача для любознательных. Пусть функция принимает на вход любую строку,
* но пробелы и знаки препинания не учитывает. Например:
* 
* palindrome('О, лета тело!'); // true
* 
*/