/*
 * Задача 9: «Простое число»
 *
 * Напишите функцию isPrime(n) для проверки, простое число n или нет.
 * Напомним, что число называют простым, если оно больше 1 и делится
 * без остатка только на 1 и на само себя.
 * 
 * На вход функция должна принимать число n и возвращать true,
 * если n простое, и false — если нет.
*/

/* Призанться честно, задачу смог решить только с помощью статей на Хабар и Stack Overflow */

function isPrime(n) {
  // Таблица простых чисел начинается с 2 . Сначала оределимся с двойкой // это та часть которую я одолел сам
  if (n < 2) {
    return false;
  } else if (n == 2) {
    return true;
  }
  // Можно попробовать в цикле делить n на все числа в диапазоне от 2 до n и проверять остаток от деления
  // Но нагрузим вычисления до "края"
  // есть подход при котром ограничиваются делителями и проверкой остатков в диапазоне от 2 до sqrt(n)
  // если в этом диапазоне есть делители с остатком 0, то число в любом случае составное
  // если таких делителей нет, то их нет до самого n
  let i = 2;
  const maxNum = Math.sqrt(n);
  while (i <= maxNum) {
    if (n % i == 0) {
      return false;
    }
    i++;
  }
  return true;
}

console.log(isPrime(0)); // false
console.log(isPrime(1)); // false
console.log(isPrime(3)); // true
console.log(isPrime(6)); // false
console.log(isPrime(17)); // true